<template>
  <view class="t-protocol t-container">
    <DeliView>
      <template v-slot:header>
        <DeliNavbar title="服务协议" :leftShow="true" :back="back" />
      </template>
      <template v-slot:content>
        <scroll-view class="main-content" :scroll-y="true">
          <view class="content">
            <view class="cool">特别提示：</view>
            <view>欢迎您来到劳务小程序！</view>
            <view>
              劳务小程序是由新三风环保科技（成都）合伙企业（有限合伙）(本协议中简称“三风科技”
              )提供的互联网软件服务。本服务条款（下称“服务条款”）是关于您（“您”或“用户”）访问和使用劳务小程序以及三风科技提供的其他服务（下称“服务”）的主要协议。
              请您在进一步操作之前仔细阅读，充分理解本协议的各个条款，特别是以加粗形式提示您注意的条款。您有权选择同意或不同意本协议，您点击“我已阅读并同意”按钮即视为您已阅读并接受本协议的所有条款。
              您完成注册程序或使用第三方账号登陆劳务小程序平台，使用劳务小程序平台服务，即视为您已充分阅读，理解本协议，并自愿接受本协议的约束。阅读本协议过程中，如果您不同意本协议或其中任何条款，请立即停止注册程序并停止使用劳务小程序平台服务。
              由于互联网行业高速发展，本服务条款并不能完整罗列并覆盖您与三风科技的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，您同意三风科技有权不时地对本服务条款做任何修改和补充，并予以公示。通常情况下（例如当需要进行修改或补充以满足适用法律要求时），对服务条款、隐私政策或规则的修改将在公布时或规定的生效日立即生效。您继续访问和使用劳务小程序即视为您接受修订后的服务条款。否则，您有权通过停止访问劳务小程序且拒绝使用服务、删除您在劳务小程序的信息和帐户等方式来终止服务条款。
              本“特别提示”是本协议正文的组成部分。
            </view>
            <view class="cool">1.服务内容</view>
            <view>
              本条款中的“产品和/或服务”指：劳务小程序向您提供的微信小程序上所展示的服务，具体服务内容以您所使用或订购的内容为准。
              根据实际需要和三风科技不时提供的其他服务内容，三风科技可能与您另行签订其他协议。同时，即使未另行签订其他协议，您使用劳务小程序的具体服务也将被视为您同意三风科技关于该等具体服务的任何要求。如果其他协议和本条款之间存在冲突，应以其他协议为准，但以该冲突和与该协议特定事宜相关为限。
              三风科技保留随时变更、中止或终止部分免费服务的权利，并保留根据实际情况随时调整劳务小程序提供的免费服务种类、形式的权利。三风科技不承担因劳务小程序提供的任何免费服务的调整给您造成的损失。三风科技有权在未来恰当的时机对任何免费服务内容收取相应的服务费用。
              您同意三风科技为满足用户需求、提升产品使用体验等需要调整、升级劳务小程序提供的收费服务，包括服务种类、形式等。如因某些情况三风科技需要终止向您提供的收费服务，三风科技将提前通过站内通知、邮件、微信公众号等形式予以通知。您同意如果三风科技终止提供某项收费服务，三风科技的义务仅在于向您返还您尚未使用的服务期对应的部分费用。您同意三风科技无需因收费服务的调整、升级或终止向您承担责任。但无论如何，三风科技将尽合理的努力给您预留合理的时间以便您为该等服务变更、中止或终止做出应对。
            </view>
            <view class="cool">2.注册以及登录</view>
            <view class="good">2.1行为能力</view>
            <view
              >在注册劳务小程序用户账户之前，您应当确认并承诺，您具备中华人民共和国法律规定的与您行为相适应的民事行为能力，同时未满18周岁，请不要注册劳务小程序用户账户。</view
            >
            <view class="good">2.2注意事项</view>
            <view>
              依劳务小程序登录提示授权用户基础信息及手机号等必要信息，若您提供任何违法、虚假、不道德或三风科技认为不适合在劳务小程序上展示的资料，或者三风科技有理由怀疑您的资料属于病毒程序或恶意操作，或者您违反本服务条款的规定，或者您未经三风科技同意将劳务小程序用于商业目的，三风科技有权暂停或终止您的帐号，并拒绝您于现在和未来使用服务之全部或任何部分。
              尽管有前述规定，三风科技无义务对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、准确性、完整性、适用性及/或是否为最新资料的责任。
              同时，三风科技建议您妥善保管您的注册邮箱、手机号、密码和名称，准确输入该等信息将作为您访问登录劳务小程序并享有服务的关键环节。如果您发现有人未经授权使用您的帐户信息或怀疑任何人未经授权可能能够访问您的私有内容，您应立即更改密码，并向我们反馈。
            </view>
            <view class="good">2.3账户安全</view>
            <view
              >您的账户由您自行设置并保管，劳务小程序任何时候均不会主动要求您提供您的账户密码。因您保管账号和密码不当而造成的所有后果，将由您自行承担。凡经您的账户密码成功登录劳务小程序小程序即视为您的使用行为：您应当对您的账户进行的所有活动及后果负法律责任。您不得以任何形式擅自转让或授权他人使用您的账户。因您主动泄露，出借账户或因您遭受他人攻击，诈骗行为导致的损失及后果，劳务小程序并不承担责任。您可以通过司法，行政等救济途径向侵权行为人追偿。</view
            >
            <view class="cool">3.使用</view>
            <view class="good">3.1发布信息</view>
            <view
              >用户有权在劳务小程序相应位置发布信息，用户承诺并保证其提供或发布的所有信息（包括但不限于用户的基本资料、项目保密信息等）是真实、准确、完整的，符合中国各项法律、法规及规范性文件以及三风科技以及劳务小程序的相关规则，不存在虚假、误导性陈述或重大遗漏，并承诺及时对已发布的信息进行更新、维护和管理。</view
            >
          </view>
        </scroll-view>
      </template>
    </DeliView>
  </view>
</template>

<script>
import { back } from "@/utils";
import DeliNavbar from "@/components/DeliNavbar/index.vue";
import DeliView from "@/components/DeliView/index.vue";
export default {
  components: { DeliNavbar, DeliView },
  setup() {
    return {
      back,
    };
  },
};
</script>

<style lang="less">
.t-protocol {
  .main-content {
    height: 100%;

    .content {
      padding: 6px 12px;
      overflow: hidden;
    }
  }

  .content {
    flex: 1;
    color: #666;
    font-size: 12px;

    .good {
      color: #333;
      font-size: 14px;
      line-height: 20px;
    }

    .cool {
      color: #000;
      font-size: 16px;
      line-height: 24px;
    }
  }
}
</style>
