<template>
  <view class="t-policy t-container">
    <DeliView>
      <template v-slot:header>
        <DeliNavbar title="隐私政策" :leftShow="true" :back="back" />
      </template>
      <template v-slot:content>
        <scroll-view class="main-content" :scroll-y="true">
          <view class="content">
            <view class="cool">特别提示：</view>
            <view>
              劳务小程序（“我们”）非常注重用户的（“您”）的个人信息及隐私，您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本隐私政策，旨在向您提示和说明我们在您在使用我们的产品或服务时我们如何收集、保存、使用、管理、共享和转让您的个人信息，以及您如何查看、更新、保护、删除此等信息。
              在使用劳务小程序各项产品和服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。一旦您开始使用劳务小程序各项产品或服务，即表示您已充分理解并同意本政策。
              如您对本隐私政策有任何疑问，您可随时通过我们的线上客服与我们取得联系。
            </view>
            <view class="good">1、用户信息的收集和使用</view>
            <view
              >我们仅会出于本政策所述的目的，收集和使用您的下列个人信息：</view
            >
            <view>1.1必须授权的个人信息</view>
            <view
              >您充分理解并同意，您在使用我们的产品/服务进行网上发单前，您必须授权我们收集、保存和使用下列信息，否则您将无法使用我们的产品/服务，我们也将无法进一步优化我们的产品，并无法充分保障您的交易安全。</view
            >
            <view>1.1.2用户注册所需信息</view>
            <view
              >您在成为劳务小程序用户时，我们将通过索要微信授权的方式来验证您的身份是否有效。在注册成为劳务小程序用户的过程中，若您提供以下额外信息补全个人资料，将有助于我们给您提供更优质更个性化的服务，上述额外信息包括您的头像、昵称、性别、常住地、生日。若您不提供这些额外信息，不会影响您网上发单的基本功能。</view
            >
            <view>1.1.2展示搜索所需信息</view>
            <view
              >为了满足商品信息展示和您的快速搜索的需要，我们可能会读取您的设备信息，包括但不限于设备类型、设备型号、设备识别码、操作系统和应用程序版本、语言设置、分辨率、软硬件特征信息等。此外，劳务小程序可能会写入您访问劳务小程序平台或使用劳务小程序服务时所使用的设备的存储空间。</view
            >
            <view>1.1.3交易及售后所需信息</view>
            <view>1)订单信息</view>
            <view
              >当您在劳务小程序发布订单时，您需在订单中至少填写您的酒店名称、酒店地址、联系人名称及电话号码，该订单会同时载明订单号、下单时间、您给到劳务方的金额。根据部分商品或服务的特点及适用法律的要求，您可能还需提供相关身份信息（如您的身份证、军官证、护照、港澳台通行证、驾驶证、社保卡、学生证或相关证件号码）、电子邮箱、您本人的照片或视频，如您不购买/不使用某些商品/服务，则无需提供相关信息。您理解并同意，我们将使用您的订单信息来进行您的身份核验、确定交易、支付结算，为您查询订单，提供客服咨询与售后服务等；我们可能还会使用您的订单信息来判断您的交易是否存在异常以保护您的交易安全。</view
            >
            <view>2)支付信息</view>
            <view
              >在您下单后，您可通过劳务小程序系统支持的第三方支付机构完成支付，支付功能本身并不收集您的个人信息，但我们需将您的订单号、交易金额以及其他您选择的支付机构要求的交易信息与您选择的支付机构共享以实现其确认您的支付指令并完成支付。</view
            >
            <view>3）客服售后所需信息</view>
            <view
              >我们在提供客户服务和售后服务时会使用您的账户信息和订单信息。为保证您的账号安全，我们的客服人员会使用您的账号信息核验您的身份。当您需要与订单相关的客服或售后服务时，我们将会查询您的订单信息。如您需要变更联系人信息、联系电话，您可能需要提供额外的其他信息。</view
            >
            <view>1.1.4改进优化所需信息</view>
            <view
              >为了改进和优化我们的服务,我们可能对您的订单信息、浏览信息等进行大数据分析，以根据您的用户特征在您搜索时向您展示或推荐您感兴趣的订单。此外，我们还可能收集您在客服和售后过程中提供的信息、参与问卷调查时答复的信息等。对于从您设备上收集到的各种信息，我们可能会进行结合关联，以便为您提供更具针对性和个性化的优质服务。</view
            >
            <view>1.1.5交易安全所需信息</view>
            <view
              >为了确保劳务小程序服务的安全性，预防网络欺诈和确保交易安全，我们可能会通过分析您的订单信息、浏览信息、浏览习惯、常用软件、设备信息等来判断您的账号风险，同时排查可能存在的劳务小程序系统风险，并记录我们认为存在风险的可疑网络链接。</view
            >
            <view>1.1.6可选择授权的个人信息</view>
            <view
              >为了进-步提升您的用户体验，我们可能会附加地收集和使用您的如下信息。您可以选择是否授权提供，如您拒绝授权，您仍可享受劳务小程序为您提供的基本服务，但您可能将无法获得基于上述附加信息带给您的额外用户体验:</view
            >
            <view>1.1.7摄像头（相机）、相册（图片库）信息</view>
            <view
              >您可以在劳务小程序上传照片或图片来晒单、发表评论信息，我们可能会通过您所上传的照片或图片来识别您需要购买的商品或服务，或使用包含您所上传照片或图片的评论信息。若劳务小程序服务支持您使用人脸识别登录或进行身份验证时，我们会收集您的面部信息。</view
            >
            <view>1.1.8通讯录信息</view>
            <view
              >为了方便您的购物，未来我们可能会使用您的通讯录信息以让您在填写联系人/接单人信息时无须手动输入。此外，我们也可能通过通讯录信息判断您的好友是否为劳务小程序用户，并为你们的交流互动建立联系渠道。</view
            >
            <view>1.1.9麦克风信息</view>
            <view
              >为了方便您的购物，未来您可以在劳务小程序平台启用麦克风功能与我们或其他主体进行交流互动。届时，我们可能会收集您的语音信息以识别您的购物、客服或售后需求。</view
            >
            <view
              >1.2.0您理解并同意,为了收集、使用您的上述信息以实现特定功能，我们需要您在您的设备中开启摄像头、相册、通讯录、麦克风的访问权限。您可在设备上随时查看上述权限的状态，并可自行决定开启或关闭。如您开启相应权限，即代表您已授权我们收集和使用相应的个人信息以实现特定功能。如您关闭相应权限，即代表您已取消了该项授权，我们将会立即停止对您相应个人信息的收集、使用，您将无法实现该项授权所对应的特定功能。但您的关闭权限决定不会影响此前我们基于您的授权对您相应个人信息所进行的收集、使用与处理。</view
            >
            <view>1.2.1依法无须征得授权的个人信息</view>
            <view
              >您充分理解并同意，收集、使用您的如下个人信息我们依法无须征得您的授权同意:</view
            >
            <view>1.2.2涉及国家安全、国防利益的；</view>
            <view>1.2.3涉及公共安全、公共卫生等重大公共利益的；</view>
            <view>2.3.3涉及刑事侦查、起诉、审判和判决执行的；</view>
            <view
              >1.2.4涉及他人生命、财产等重大合法权益但又无法征得信息主体同意的；</view
            >
            <view>1.2.5信息主体自行向社会公众公开的；</view>
            <view
              >1.2.6在合法公开披露的信息中已存在的个人信息，如合法的新闻报道、政府公开信息等渠道；</view
            >
            <view>1.2.7维护产品/服务的安全稳定运行所必需的；</view>
            <view>1.2.8合法的新闻报道所必需的；</view>
            <view
              >1.2.9科研学术研究所必需的，且已在公开发表的研究论文或报告中对个人信息进行了去标识化处理的；</view
            >
            <view>1.2.10法律法规规定的其他情形。</view>
            <view>1.2.11从第三方获取的个人信息</view>
            <view
              >我们在向您提供产品/服务的过程中，可能会通过我们的关联方及合作方获取您的相关信息，您对此表示理解和同意。如您通过第三方账户登录并使用我们的产品/服务，则代表您同意并授权我们可以使用您在第三方账户中的相关个人信息(包括但不限于昵称、头像等)。</view
            >
            <view>
              1.2.12
              其他用户提供或分享的信息中可能含有您的信息。例如，其他用户提供的物流地址或分享的内容中可能包含您的信息。
            </view>
            <view>1.2.13用户信息的授权使用</view>
            <view
              >为向您提供满意优质的服务，您理解、同意并授权我们将您的信息用于下列用途：</view
            >
            <view>1.2.14向您提供您使用的各项服务，并维护、改进这些服务。</view>
            <view
              >1.2.15向您推荐您可能感兴趣的内容，包括但不限于向您发出产品、服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与劳务小程序的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。我们在向您推荐您可能感兴趣的内容时仅使用您在劳务小程序平台内的信息。如您不希望接收上述信息，可通过退订功能退订；</view
            >
            <view>
              1.2.16
              我们可能会使用您的个人信息以验证身份、预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他劳务小程序用户，或我们或其关联方的合法权益；
            </view>
            <view
              >1.2.17我们可能会将来自某项服务的信息与来自其他服务所获得的信息结合起来，用于为您提供更加个性化的服务使用。</view
            >
            <view
              >1.2.18我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。</view
            >
            <view>1.2.19邀请您参与有关我们产品、服务的调查；</view>
            <view>1.2.20经您同意或授权的或法律法规允许的其他用途。</view>
            <view class="good">2、COOKIES及类似技术的使用</view>
            <view>
              2.1
              COOKIES:就是当您访问任何网站时，这些网站可能传送到您的浏览器并存储在您设备中的一一些信息。当您再次访问这些网站时，存储在您设备中的COOKIES会将之前存储的信息返回至网站。COOKIE的使用，可以在有关网站上存放您的访问信息，从而提升您的访问体验。我们向您发送COOKIES是为了简化您重复登录的步骤、存储您购物车中的商品数据、为您提供购物的偏好设置、帮助判断您的账户或数据安全。您理解并同意，我们的某些服务只有通过COOKIES才能得到实现。
              大部份网络浏览器都被默认设定为接受COOKIES。然而，您可重新设定您的浏览器或软件，以拒绝接受一切COOKIES或显示接收到COOKIES。若您选择拒绝接受劳务小程序的COOKIES，在某些情况下可能会影响您正常使用劳务小程序服务或安全访问劳务小程序平台。
            </view>
            <view>
              2.1.2WEB
              BEACONS:也被称为“网站信标”、网络数据采集程序或者互联网访问标签,它是内嵌在网页和电子邮件内的小型图形文件，可以让我们通过监控用户的访问活动从而使得COOKIES更为有效。通过收集访问者在收到我们的电邮或指引信息之前和之后访问的情况，它可以帮助我们或我们的第三方合作伙伴评估访问行为，从而预估及提高我们的市场推广效率。我们使用日志档案储存通过WEB
              BEACONS所收集的信息数据。
            </view>
            <view class="good">3、用户信息的使用</view>
            <view>3.1个人信息的用途</view>
            <view
              >您充分理解并完全同意,我们有可能将您的个人信息用于下列某一个或者某几个目的:</view
            >
            <view
              >1)向您提供服务，运营、保护、改进、优化有关功能和体验。如用于验证您的身份、供您确认订单、发送通知(包括但不限于取货提醒、产品信息、活动信息等)及其他客户服务等；</view
            >
            <view
              >2)帮助我们通过大数据分析等途径了解用户需求。根据您的搜索与购买记录、个人资料信息和偏好，以及您向我们提交的其他信息,我们会进行行为分析，以精简您日后的购买流程，以此设计新的商业模式，或向您推荐新的产品，或将其用于我们所开展的新业务当中；</view
            >
            <view
              >3)用于创建和维护，一个受到信任的以及更安全的网络购物环境，检测和预防欺诈、垃圾信息、安全事件及其他有害活动。包括开展安全调查和风险评估，解决我们与任何用户之间的争议，并执行我们与第三方的约定，或执行我们的服务条款及其他政策；</view
            >
            <view>4)其他用于改进我们的服务、</view>
            <view
              >提升用户体验的目的。我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意；</view
            >
            <view
              >5)经您同意或授权的以及法律法规所允许的其他使用目的或方式。</view
            >
            <view>3.2使用规则</view>
            <view
              >1)如您使用我们的产品/服务则代表您同意在此期间持续地授权我们使用您的相关个人信息;</view
            >
            <view
              >2)我们有权对用户数据库进行分析并予以商业化的利用，在此种情形下,我们将会对您的个人信息通过技术手段进行去标识化处理，以确保您的个人隐私不会被泄露;</view
            >
            <view
              >3)基于服务的需要，我们可能会向我们的关联方及合作方展示您的个人信息，但我们会通过内容替换、匿名处理等方式进行脱敏，保障您的信息安全。</view
            >
            <view
              >4）您充分理解并同意，我们在防止欺诈等违法活动、减少信用风险等情况下，可能与其他公司或组织交换用户个人信息，但并不包括违反本政策中所作的承诺而为获利目的出售、出租、共享或以其它任何方式披露的个人信息。</view
            >
            <view class="good">4.用户信息的共享、转让、公开披露</view>
            <view>4.1用户信息的共享</view>
            <view
              >4.1.1除下列情况外,我们不会与劳务小程序以外的任何第三方共享您的个人信息:</view
            >
            <view
              >1)经您同意或授权的(包括但不限于与您签订的其他相关法律文件及平台规则等)；</view
            >
            <view>2)为配合相关行政或司法机关的强制性要求所必需提供的；</view>
            <view
              >3)在法律法规允许的范围内，为维护劳务小程序及其关联方、各合作伙伴或劳务小程序平台用户的人身财产安全免遭损害而必须提供的，比如为防止欺诈等违法活动；</view
            >
            <view
              >4)向您提供我们的服务所必须共享的信息。我们可能向合作伙伴或其他第三方分享您的信息，保障我们对您的服务能够顺利完成，例如:提供支付服务的支付机构、签署合同的电子签约平台、第三方物流公司或其他服务提供方；</view
            >
            <view>5)基于学术研究而使用；</view>
            <view>6)基于符合法律法规的社会公共利益而提供。</view>
            <view
              >4.1.2您理解并同意,我们可能会将您的个人信息与我们的关联方或合作伙伴进行共享，以确保为您服务的顺利进行。但我们仅会出于合法、正当、必要、明确的目的共享您的个人信息，且会严格遵守本隐私政策的规定，排除非必要的个人信息共享。</view
            >
            <view
              >4.1.3对于与我们共享信息的第三方主体，我们会与其签订严格的保密协议，并要求其采取相应的技术措施确保个人信息的安全可控。</view
            >
            <view>4.2用户信息的转让</view>
            <view>除下列情况外，我们不会向任何第三方转让您的个人信息:</view>
            <view
              >1)经您同意或授权的(包括但不限于与您签订的其他相关法律文件及平台规则等)；</view
            >
            <view>2)为配合相关行政或司法机关的强制性要求所必需提供的；</view>
            <view
              >3)随着劳务小程序业务的持续发展，我们可能会进行合作、并购、联营、资产转让或类似交易，而您的个入信息有可能作为交易标的的一部分而被转移。我们会要求新的持有您个人信息的第三方继续遵守本隐私政策，否则，我们将要求该第三方重新征得您的授权同意。</view
            >
            <view>4.3用户信息的公开披露</view>
            <view>4.3.1我们仅会在以下情况下公开披露您的个人信息:</view>
            <view
              >1)经您同意或授权的(包括但不限于与您签订的其他相关法律文件及平台规则等)；</view
            >
            <view>2)为配合相关行政或司法机关的强制性要求所必需的；</view>
            <view>3)基于公共利益的需要或法律法规的要求而披露。</view>
            <view
              >4.3.2经过脱敏和去标识化处理且无法还原识别信息主体的个人信息依法不受本隐私政策的约束，您理解并同意，对上述信息的共享、转让及公开披露无须征得您的同意。</view
            >
            <view class="good">5.用户信息的保存和保护</view>
            <view>5.1用户信息的保存</view>
            <view
              >5.1.1您的个人信息将全部存储在中华人民共和国境内，除非法律法规另有明确规定或获得了您的明确授权。</view
            >
            <view
              >5.1.2我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。</view
            >
            <view
              >5.1.2如果我们终止服务或运营，会至少提前三十日通知您，并在终止服务或运营后对您的个人信息进行删除或脱敏处理。</view
            >
            <view>5.2用户信息的保护</view>
            <view
              >5.2.1劳务小程序高度重视用户信息的保护，我们会严格根据国家法律法规及监管政策的要求尽-切合理努力保护您的个人信息，防止您的个人信息在意外或未经授权的情况下被非法访问、复制、修改、公开披露、破坏、处理或使用。</view
            >
            <view
              >5.2.2我们提供的个人信息保护措施仅适用于我们平台，一旦您离开我们平台，浏览或使用其他平台服务或内容资源，我们没有能力及义务保护您在我们以外的任何地方提交的任何个人信息。</view
            >
            <view
              >5.2.3我们会采取合适的安全措施、程序和技术手段保护您的个人信息，以防止您的隐私泄露或遭到不法侵害，但您充分理解并同意:由于技术的限制、风险防范的局限性以及可能存在的各种恶意手段，即使我们尽最大努力加强安全，也无法始终确保信息的绝对安全。</view
            >
            <view
              >5.2.4我们对个人信息的访问设置了严密的权限控制机制和监控机制。如我们的员工、关联方或合作伙伴未能履行相应保密义务，我们将会追究其法律责任或解除与其的合作关系。</view
            >
            <view
              >5.2.5网络环境中始终存在各种信息泄漏的风险，当出现意外事件、不可抗力等情形导致您的信息出现泄漏时,我们将极力控制局面,及时告知您事件起因、我们采取的安全措施、您可以主动采取的安全措施等相关情况。我们会同时将事件相关情况以邮件、信件、电话等形式告知您,难以告知您时，我们会采取发布公告的形式进行告知。同时，我们还将依照监管部门要求，就个人信息安全事件的处置情况主动上报。</view
            >
            <view class="good">6.个人信息的管理</view>
            <view
              >我们注重您对个人信息的管理权利，您可通过对个人信息的访问、更正、删除及撤回授权等手段，以充分保障您的个人隐私安全。</view
            >
            <view>6.1个人信息的访问和更正</view>
            <view>6.1.1您可访问或更正您的如下信息:</view>
            <view
              >1)账户信息:您可登录账号访问“我的”页面进入“个人中心”，查看您的个人基本信息。</view
            >
            <view>
              2)订单信息:您可登录账号访问“我的”页面进入“个人中心”点击“我的订单”进入“订单管理”,查看您的全部订单记录(
              含“未付款”、“成功拼单”、“未成功拼单”、“待提货”、“已提货”)。
            </view>
            <view
              >3)自提门店信息:您可登录账号访问“我的”页面进入“个人中心”在”我的当前自提点”栏目下查看提货门店信息，您也可以点击“切换自提点”更改您的提货门店。</view
            >
            <view
              >4)搜索信息:您可登录账号在首页点击“搜索商品”栏目，查看或清空您的历史搜索记录。</view
            >
            <view
              >6.1.2如您需访问或更正您在使用我们产品/服务过程中形成的其他个人信息，您可通过劳务小程序线上客服与我们取得联系。我们将会根据本隐私政策所列明的方式和期限响应您的请求。</view
            >
            <view
              >6.1.3为了提升用户体验和保证交易安全，您的部分个人信息无法提供访问或更正服务，对此您表示理解和同意。上述信息我们仅会在您授权的范围内使用。</view
            >
            <view>6.2个人信息的删除</view>
            <view
              >6.2.1您可通过第6.1.1条所列明的方式删除您的部分个人信息，此外，您可在下列情形中向我们提出删除个人信息的请求:</view
            >
            <view>1)我们处理个人信息的行为违反了法律法规；</view>
            <view>2)我们收集、使用您的个人信息，却未征得您的同意；</view>
            <view>3)我们处理个人信息的行为严重违反了本政策的规定；</view>
            <view>4)我们终止运营和服务。</view>
            <view>6.2.2请注意，如果您申请删除您的个人信息：</view>
            <view
              >1)我们可能会出于安全原因保留您的一些个人信息。例如，如果我们因欺诈或安全原因停用了某账户，则我们可能会保留该账户的某些信息，以防止该用户将来再次创建新的账户。</view
            >
            <view
              >2)为履行我们的法律义务，我们可能会保留并使用您的个人信息。例如，劳务小程序可能会出于履行税务、法律报告、审计义务以及诉讼时效的要求而保留您的一些信息。</view
            >
            <view
              >3)为了防止数据的意外损失和破坏，您个人信息的残留副本可能不会在有限的时间内从我们的备份系统中删除。</view
            >
            <view>6.3授权的变更和撤回</view>
            <view
              >您可以随时通过信息的删除、关闭设备相应功能、更改软件设置或与我们取得联系来变更您授权我们收集、使用个人信息的范围或撇回您的授权。您变更授权范围或撤回授权后我们将无法为您提供相对应的服务，也不再处理相应的个人信息。但您的上述决定，并不会影响此前基于您的授权而进行的个人信息处理。</view
            >
            <view>6.4请求的响应</view>
            <view
              >6.4.1如您无法通过上述方式管理您的个人信息，或您认为劳务小程序对个人信息的收集、使用、处理存在违法或违约行为的，您均可以通过劳务小程序线上客服与我们取得联系。出于安全的保障，我们可能会要求您出具书面申请，并进行实名的身份验证。对于您的合理请求，原则上我们不收取费用，但对于多次重复、超出合理限度的请求，我们将会酌情收取成本费用，而对于那些恶意请求、实现成本过高、严重不切实际或可能侵害他人合法权益的请求，我们将会直接拒绝。</view
            >
            <view
              >6.4.2您理解并同意，依据法律法规的要求，您的下列请求我们将无法响应:</view
            >
            <view>1)涉及国家安全、国防利益的；</view>
            <view>2)涉及公共安全、公共卫生等重大公共利益的；</view>
            <view>3)涉及刑事侦查、起诉、审判和判决执行的；</view>
            <view>4)有证据表明信息主体存在主观恶意或滥用权利的；</view>
            <view
              >5)响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</view
            >
            <view>6)涉及商业秘密的。</view>
            <view class="good">7.未成年人信息保护</view>
            <view
              >7.1劳务小程序高度重视对未成年人信息的保护。若您为不满18周岁的未成年人，只有在征得您的监护人的同意下，方可使用我们的产品/服务。您和您的监护人应仔细阅读本隐私政策。</view
            >
            <view
              >7.2劳务小程序将会严格依照法律法规的规定履行对未成年人信息的保护义务，对于经监护人同意而收集的未成年人信息，我们只会在法律允许的范围内或基于保护未成年人利益所必要之目的而使用该等信息。</view
            >
            <view
              >7.3如我们在事先未获得可证实的监护人的同意的情况下而收集了未成年人的个人信息，我们将在知晓后尽快予以删除。</view
            >
            <view class="good">8.其他</view>
            <view>8.1条款的独立性</view>
            <view
              >如果根据适用的法律认定本政策中的任何条款或者任何条款中的任何部分无效、违法或者不具有可执行性，这种无效、违法或者不具有可执行性不影响本政策中的任何其它条款或者这些条款中的任何其它部分的效力。</view
            >
            <view
              >8.2您对本政策或您的个人信息相关事宜有任何问题、意见或建议，请联系劳务小程序客服或通过个人中心“设置”中的“意见反馈”联系我们。</view
            >
            <view
              >8.2.1一般情况下，我们将在三十天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼来寻求解决方案。</view
            >
            <view>8.3 生效日期 本政策于2021年12月31日首次生效。</view>
          </view>
        </scroll-view>
      </template>
    </DeliView>
  </view>
</template>

<script>
import { back } from "@/utils";
import DeliNavbar from "@/components/DeliNavbar/index.vue";
import DeliView from "@/components/DeliView/index.vue";
export default {
  components: { DeliNavbar, DeliView },
  setup() {
    return {
      back,
    };
  },
};
</script>

<style lang="less">
.t-policy {
  .main-content {
    height: 100%;

    .content {
      padding: 6px 12px;
      overflow: hidden;
    }
  }

  .content {
    flex: 1;
    color: #666;
    font-size: 12px;

    .good {
      color: #333;
      font-size: 14px;
      line-height: 20px;
    }

    .cool {
      color: #000;
      font-size: 16px;
      line-height: 24px;
    }
  }
}
</style>
